{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "BERT_MultiLabel_MultiClass", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "Custom>TFBertMainLayer", "config": {"name": "bert", "trainable": true, "dtype": "float32", "config": {"return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "use_bfloat16": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "architectures": ["BertForMaskedLM"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": null, "pad_token_id": 0, "eos_token_id": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "xla_device": null, "_name_or_path": "bert-base-uncased", "model_type": "bert", "vocab_size": 30522, "hidden_size": 768, "num_hidden_layers": 12, "num_attention_heads": 12, "hidden_act": "gelu", "intermediate_size": 3072, "hidden_dropout_prob": 0.1, "attention_probs_dropout_prob": 0.1, "max_position_embeddings": 512, "type_vocab_size": 2, "initializer_range": 0.02, "layer_norm_eps": 1e-12, "gradient_checkpointing": false, "position_embedding_type": "absolute", "use_cache": true, "transformers_version": "4.2.2"}}, "name": "bert", "inbound_nodes": [{"input_ids": ["input_ids", 0, 0, {}]}]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["bert", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "pooled_output", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "pooled_output", "inbound_nodes": [[["bidirectional", 0, 0, {"training": false}]]]}, {"class_name": "Dense", "config": {"name": "Emotion", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Emotion", "inbound_nodes": [[["pooled_output", 0, 0, {}]]]}], "input_layers": {"input_ids": ["input_ids", 0, 0]}, "output_layers": {"Emotion": ["Emotion", 0, 0]}}}, "training_config": {"loss": {"Emotion": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": true, "label_smoothing": 0}}}, "metrics": [[{"class_name": "CategoricalAccuracy", "config": {"name": "accuracy", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "clipnorm": 1.0, "learning_rate": 4.999999873689376e-05, "decay": 0.009999999776482582, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of105.bin", "group1-shard2of105.bin", "group1-shard3of105.bin", "group1-shard4of105.bin", "group1-shard5of105.bin", "group1-shard6of105.bin", "group1-shard7of105.bin", "group1-shard8of105.bin", "group1-shard9of105.bin", "group1-shard10of105.bin", "group1-shard11of105.bin", "group1-shard12of105.bin", "group1-shard13of105.bin", "group1-shard14of105.bin", "group1-shard15of105.bin", "group1-shard16of105.bin", "group1-shard17of105.bin", "group1-shard18of105.bin", "group1-shard19of105.bin", "group1-shard20of105.bin", "group1-shard21of105.bin", "group1-shard22of105.bin", "group1-shard23of105.bin", "group1-shard24of105.bin", "group1-shard25of105.bin", "group1-shard26of105.bin", "group1-shard27of105.bin", "group1-shard28of105.bin", "group1-shard29of105.bin", "group1-shard30of105.bin", "group1-shard31of105.bin", "group1-shard32of105.bin", "group1-shard33of105.bin", "group1-shard34of105.bin", "group1-shard35of105.bin", "group1-shard36of105.bin", "group1-shard37of105.bin", "group1-shard38of105.bin", "group1-shard39of105.bin", "group1-shard40of105.bin", "group1-shard41of105.bin", "group1-shard42of105.bin", "group1-shard43of105.bin", "group1-shard44of105.bin", "group1-shard45of105.bin", "group1-shard46of105.bin", "group1-shard47of105.bin", "group1-shard48of105.bin", "group1-shard49of105.bin", "group1-shard50of105.bin", "group1-shard51of105.bin", "group1-shard52of105.bin", "group1-shard53of105.bin", "group1-shard54of105.bin", "group1-shard55of105.bin", "group1-shard56of105.bin", "group1-shard57of105.bin", "group1-shard58of105.bin", "group1-shard59of105.bin", "group1-shard60of105.bin", "group1-shard61of105.bin", "group1-shard62of105.bin", "group1-shard63of105.bin", "group1-shard64of105.bin", "group1-shard65of105.bin", "group1-shard66of105.bin", "group1-shard67of105.bin", "group1-shard68of105.bin", "group1-shard69of105.bin", "group1-shard70of105.bin", "group1-shard71of105.bin", "group1-shard72of105.bin", "group1-shard73of105.bin", "group1-shard74of105.bin", "group1-shard75of105.bin", "group1-shard76of105.bin", "group1-shard77of105.bin", "group1-shard78of105.bin", "group1-shard79of105.bin", "group1-shard80of105.bin", "group1-shard81of105.bin", "group1-shard82of105.bin", "group1-shard83of105.bin", "group1-shard84of105.bin", "group1-shard85of105.bin", "group1-shard86of105.bin", "group1-shard87of105.bin", "group1-shard88of105.bin", "group1-shard89of105.bin", "group1-shard90of105.bin", "group1-shard91of105.bin", "group1-shard92of105.bin", "group1-shard93of105.bin", "group1-shard94of105.bin", "group1-shard95of105.bin", "group1-shard96of105.bin", "group1-shard97of105.bin", "group1-shard98of105.bin", "group1-shard99of105.bin", "group1-shard100of105.bin", "group1-shard101of105.bin", "group1-shard102of105.bin", "group1-shard103of105.bin", "group1-shard104of105.bin", "group1-shard105of105.bin"], "weights": [{"name": "Emotion/kernel", "shape": [128, 5], "dtype": "float32"}, {"name": "Emotion/bias", "shape": [5], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/word_embeddings/weight", "shape": [30522, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/position_embeddings/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/token_type_embeddings/embeddings", "shape": [2, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._0/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._1/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._2/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._3/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._4/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._5/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._6/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._7/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._8/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._9/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._10/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/query/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/query/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/key/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/key/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/value/kernel", "shape": [768, 12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/self/value/bias", "shape": [12, 64], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/dense/kernel", "shape": [12, 64, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/encoder/layer_._11/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_model/bert/pooler/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_model/bert/pooler/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/lstm_cell_1/kernel", "shape": [768, 256], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/lstm_cell_1/bias", "shape": [256], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell_2/kernel", "shape": [768, 256], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell_2/bias", "shape": [256], "dtype": "float32"}]}]}